In [21]:
import pandas as pd

In [22]:
df = pd.read_csv('Load_Data_V1_Final_Complete.csv')

In [23]:
df.drop(columns = ['Unnamed: 0', 'index', 'Unnamed: 0.1'], inplace=True)

In [24]:
df

                       Date  Haryana Load (MW)
0       2016-01-01 00:00:00                NaN
1       2016-01-01 00:15:00            4099.37
2       2016-01-01 00:30:00            3995.64
3       2016-01-01 00:45:00            3954.80
4       2016-01-01 01:00:00            3904.93
...                     ...                ...
210427  2021-12-31 22:45:00            4712.55
210428  2021-12-31 23:00:00            4649.58
210429  2021-12-31 23:15:00            4571.39
210430  2021-12-31 23:30:00            4510.39
210431  2021-12-31 23:45:00            4449.94

[210432 rows x 2 columns]

In [25]:
df_2020 = pd.read_csv('2020_Load_Data.csv')

In [26]:
df_2020.drop(columns=['Unnamed: 0'], inplace=True)

In [30]:
df.Date[0][:7]#.dt.year == 2020

'2016-01'

In [42]:
df.drop(columns = ['index'], inplace= True)

In [44]:
df

                       Date  Haryana Load (MW)
0       2016-01-01 00:00:00                NaN
1       2016-01-01 00:15:00            4099.37
2       2016-01-01 00:30:00            3995.64
3       2016-01-01 00:45:00            3954.80
4       2016-01-01 01:00:00            3904.93
...                     ...                ...
210427  2021-12-31 22:45:00            4712.55
210428  2021-12-31 23:00:00            4649.58
210429  2021-12-31 23:15:00            4571.39
210430  2021-12-31 23:30:00            4510.39
210431  2021-12-31 23:45:00            4449.94

[210432 rows x 2 columns]

In [45]:
df.iloc[143232] = ['2020-02-01 00:00:00', 4010]

In [52]:
df.iloc[143232]

Date                 2020-02-01 00:00:00
Haryana Load (MW)                 4010.0
Name: 143232, dtype: object

In [48]:
df

                       Date  Haryana Load (MW)
0       2016-01-01 00:00:00                NaN
1       2016-01-01 00:15:00            4099.37
2       2016-01-01 00:30:00            3995.64
3       2016-01-01 00:45:00            3954.80
4       2016-01-01 01:00:00            3904.93
...                     ...                ...
210427  2021-12-31 22:45:00            4712.55
210428  2021-12-31 23:00:00            4649.58
210429  2021-12-31 23:15:00            4571.39
210430  2021-12-31 23:30:00            4510.39
210431  2021-12-31 23:45:00            4449.94

[210432 rows x 2 columns]

In [55]:
df2 = pd.DataFrame([df.iloc[i] for i in range(len(df.Date)) if not (df.Date[i][:4] == '2020' and df.Date[i][:7] != '2020-01')])

In [56]:
df2

                       Date  Haryana Load (MW)
0       2016-01-01 00:00:00                NaN
1       2016-01-01 00:15:00            4099.37
2       2016-01-01 00:30:00            3995.64
3       2016-01-01 00:45:00            3954.80
4       2016-01-01 01:00:00            3904.93
...                     ...                ...
210427  2021-12-31 22:45:00            4712.55
210428  2021-12-31 23:00:00            4649.58
210429  2021-12-31 23:15:00            4571.39
210430  2021-12-31 23:30:00            4510.39
210431  2021-12-31 23:45:00            4449.94

[178272 rows x 2 columns]

In [58]:
df2 = df2.append(df_2020)

In [59]:
df2

                      Date  Haryana Load (MW)
0      2016-01-01 00:00:00                NaN
1      2016-01-01 00:15:00            4099.37
2      2016-01-01 00:30:00            3995.64
3      2016-01-01 00:45:00            3954.80
4      2016-01-01 01:00:00            3904.93
...                    ...                ...
32389  2020-12-31 22:45:00            5047.28
32390  2020-12-31 23:00:00            4999.38
32391  2020-12-31 23:15:00            4869.31
32392  2020-12-31 23:30:00            4795.35
32393  2020-12-31 23:45:00            4735.48

[210666 rows x 2 columns]

In [64]:
df2.drop_duplicates(subset='Date', inplace=True)

In [65]:
df2

                      Date  Haryana Load (MW)
0      2016-01-01 00:00:00                NaN
1      2016-01-01 00:15:00            4099.37
2      2016-01-01 00:30:00            3995.64
3      2016-01-01 00:45:00            3954.80
4      2016-01-01 01:00:00            3904.93
...                    ...                ...
32389  2020-12-31 22:45:00            5047.28
32390  2020-12-31 23:00:00            4999.38
32391  2020-12-31 23:15:00            4869.31
32392  2020-12-31 23:30:00            4795.35
32393  2020-12-31 23:45:00            4735.48

[209444 rows x 2 columns]

In [63]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 209444 entries, 0 to 32393
Data columns (total 2 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Date               209444 non-null  object
 1   Haryana Load (MW)  204391 non-null  float64
dtypes: float64(1), object(1)
memory usage: 4.8+ MB

In [66]:
df_all = pd.read_csv('all_timestamps_2.csv')

In [70]:
df_all = df_all.rename(columns = {'0': 'Date'}).drop(columns=['Unnamed: 0'])

In [71]:
dfV1 = df_all.merge(df2, how = 'left', left_on = 'Date', right_on= 'Date')

In [73]:
dfV1.to_csv('Load_Data_V1_Final_Correct.csv')

In [77]:
dfV1 = dfV1[1:]

In [83]:
dfV1.fillna(method='ffill').info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 210431 entries, 1 to 210431
Data columns (total 2 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Date               210431 non-null  object
 1   Haryana Load (MW)  210431 non-null  float64
dtypes: float64(1), object(1)
memory usage: 4.8+ MB

In [84]:
dfV2 = dfV1.fillna(method = 'ffill')

In [85]:
dfV2

                       Date  Haryana Load (MW)
1       2016-01-01 00:15:00            4099.37
2       2016-01-01 00:30:00            3995.64
3       2016-01-01 00:45:00            3954.80
4       2016-01-01 01:00:00            3904.93
5       2016-01-01 01:15:00            3654.68
...                     ...                ...
210427  2021-12-31 22:45:00            4712.55
210428  2021-12-31 23:00:00            4649.58
210429  2021-12-31 23:15:00            4571.39
210430  2021-12-31 23:30:00            4510.39
210431  2021-12-31 23:45:00            4449.94

[210431 rows x 2 columns]

In [86]:
dfV2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 210431 entries, 1 to 210431
Data columns (total 2 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Date               210431 non-null  object
 1   Haryana Load (MW)  210431 non-null  float64
dtypes: float64(1), object(1)
memory usage: 4.8+ MB

In [87]:
dfV2.to_csv('Load_Data_V2_Final_Correct.csv')

In [88]:
dfV2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 210431 entries, 1 to 210431
Data columns (total 2 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Date               210431 non-null  object
 1   Haryana Load (MW)  210431 non-null  float64
dtypes: float64(1), object(1)
memory usage: 4.8+ MB